---
kind: property
id: P:Autodesk.Revit.DB.ParameterValuePresenceRule.Parameter
zh: 参数、共享参数
source: html/a412718c-49f2-bb49-841b-673d5e1ca657.htm
---
# Autodesk.Revit.DB.ParameterValuePresenceRule.Parameter Property

**中文**: 参数、共享参数

The parameter which will be evaluated to pass this rule.

## Syntax (C#)
```csharp
public ElementId Parameter { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null